#+title: Sending email with react-email
#+subtitle: its nicer to use their interative builder but why not just the simple thing
#+tags[]: react email htmlq reactemail
#+date: 2024-07-27T19:10:53

Install stuff we'll need:

#+begin_src bash
  npm install react-email @react-email/components
  npm install -D tsup typescript
  npm install resend
#+end_src

Which installs so much stuff...

#+begin_src bash :results output
  ls -l node_modules | wc -l
  du -sh node_modules
#+end_src

#+RESULTS:
:      336
: 446M	node_modules

And gives us something like:

#+begin_src javascript :tangle package.json
  {
      "type": "module",
      "main": "./dist/index.js",
      "module": "./dist/index.mjs",
      "types": "./dist/index.d.ts",
      "files": [
          "dist/**"
      ],
      "scripts": {
          "emaildev": "email dev",
          "build": "tsup --dts --external react",
          "dev": "tsup --dts --external react --watch",
          "clean": "rm -rf dist"
      },
      "dependencies": {
          "@react-email/components": "^0.0.22",
          "react-email": "^2.1.6",
          "resend": "^3.5.0"
      },
      "devDependencies": {
          "tsup": "^8.2.3",
          "typescript": "^5.5.4"
      }
  }

#+end_src

A quite little tsup.config.ts:

#+begin_src javascript :tangle tsup.config.ts
  import { defineConfig } from 'tsup'

  export default defineConfig({
      entry: ['render.tsx', 'resend.tsx'],
      target: 'es2024'
  })
#+end_src

Then we need to configure typescript, like so:

// tsconfig.json
#+begin_src javascript :tangle tsconfig.json
  {
  "compilerOptions": {
    "composite": false,
    "declaration": true,
    "declarationMap": true,
    "esModuleInterop": true,
    "forceConsistentCasingInFileNames": true,
    "inlineSources": false,
    "isolatedModules": true,
    "moduleResolution": "node",
    "noUnusedLocals": false,
    "noUnusedParameters": false,
    "preserveWatchOutput": true,
    "skipLibCheck": true,
    "strict": true,
    "strictNullChecks": true,
    "jsx": "react-jsx",
    "lib": ["ESNext", "DOM", "DOM.Iterable"],
    "module": "ESNext",
    "target": "es6",
  },
  "include": ["."],
  "exclude": ["dist", "build", "node_modules"]
}


#+end_src

* Testing

I'm pulling the API key out of 1password:

#+begin_src bash :tangle environment
  # environment
  RESEND_API=op://Personal/Resend API/notesPlain
#+end_src

And then:

#+begin_src bash  :results output
  op run --env-file environment -- node dist/resend.cjs 
#+end_src

#+RESULTS:
: Email sent
: { data: { id: '6185f47f-f825-46f1-8557-a432ad2ccfc1' }, error: null }

